zhelezyaka/stm32-tft/trunk/User/ili9325.c
#include "stm32f10x.h"
#include "ili9325.h"
#include "reg.h"
#include "util.h"
#include "fonts.h"

#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))  


static sFONT *lcdCurrentfonts;
/* Global variables to set the written text color */
static  __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;


static void PutPixel(int16_t x, int16_t y);
static void lcdPolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);

/**
  * @brief  DeInitializes the LCD.
  * @param  None
  * @retval None
  */
void lcdDeInit(void)
{ 
    GPIO_InitTypeDef GPIO_InitStructure;

    /*!< LCD Display Off */
    lcdDisplayOff();

    /* BANK 1 (of NOR/SRAM Bank 1~4) is disabled */
    FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);

    /*!< LCD_SPI DeInit */
    FSMC_NORSRAMDeInit(FSMC_Bank1_NORSRAM1);

    /* Set PD.00(D2), PD.01(D3), PD.04(NOE), PD.05(NWE), PD.08(D13), PD.09(D14),
     PD.10(D15), PD.14(D0), PD.15(D1) as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 |
                                GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
    /* Set PE.07(D4), PE.08(D5), PE.09(D6), PE.10(D7), PE.11(D8), PE.12(D9), PE.13(D10),
     PE.14(D11), PE.15(D12) as alternate function push pull */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | 
                                GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | 
                                GPIO_Pin_15;
    GPIO_Init(GPIOE, &GPIO_InitStructure);
    /* Set PD.11(A0 (RS)) as alternate function push pull */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_Init(GPIOD, &GPIO_InitStructure);
    /* Set PD.7(NE1 (LCD/CS)) as alternate function push pull - CE3(LCD /CS) */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
    GPIO_Init(GPIOD, &GPIO_InitStructure); 
}


/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void ili9325_lcdInit(void)
{ 
    __IO uint32_t lcdid = 0;
  
    /* Configure the LCD Control pins --------------------------------------------*/
    lcdCtrlLinesConfig();
    /* Configure the FSMC Parallel interface -------------------------------------*/
    lcdFSMCConfig();
  
    _delay_(5); /* delay 50 ms */
    lcdReset();
    /* Read the LCD ID */
    lcdid = lcdReadReg(0x00);
  
    if(lcdid == 0x9325 || lcdid == 0x9328) /* Check if the LCD is ILI9325 Controller */
    {
        /* Start Initial Sequence ------------------------------------------------*/
        lcdWriteReg(LCD_REG_0, 0x0001);  /* Start internal OSC. */
        lcdWriteReg(LCD_REG_1, 0x0100);  /* Set SS and SM bit */
        lcdWriteReg(LCD_REG_2, 0x0700);  /* Set 1 line inversion */
        lcdWriteReg(LCD_REG_3, 0x1018);  /* Set GRAM write direction and BGR=1. */
        lcdWriteReg(LCD_REG_4, 0x0000);  /* Resize register */
        lcdWriteReg(LCD_REG_8, 0x0202);  /* Set the back porch and front porch */
        lcdWriteReg(LCD_REG_9, 0x0000);  /* Set non-display area refresh cycle ISC[3:0] */
        lcdWriteReg(LCD_REG_10, 0x0000); /* FMARK function */
        lcdWriteReg(LCD_REG_12, 0x0000); /* RGB interface setting */
        lcdWriteReg(LCD_REG_13, 0x0000); /* Frame marker Position */
        lcdWriteReg(LCD_REG_15, 0x0000); /* RGB interface polarity */

        /* Power On sequence -----------------------------------------------------*/
        lcdWriteReg(LCD_REG_16, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
        lcdWriteReg(LCD_REG_17, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
        lcdWriteReg(LCD_REG_18, 0x0000); /* VREG1OUT voltage */
        lcdWriteReg(LCD_REG_19, 0x0000); /* VDV[4:0] for VCOM amplitude */
        _delay_(20);                     /* Dis-charge capacitor power voltage (200ms) */
        lcdWriteReg(LCD_REG_16, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
        lcdWriteReg(LCD_REG_17, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
        _delay_(5);                      /* Delay 50 ms */
        lcdWriteReg(LCD_REG_18, 0x0139); /* VREG1OUT voltage */
        _delay_(5);                      /* Delay 50 ms */
        lcdWriteReg(LCD_REG_19, 0x1d00); /* VDV[4:0] for VCOM amplitude */
        lcdWriteReg(LCD_REG_41, 0x0013); /* VCM[4:0] for VCOMH */
        _delay_(5);                      /* Delay 50 ms */
        lcdWriteReg(LCD_REG_32, 0x0000); /* GRAM horizontal Address */
        lcdWriteReg(LCD_REG_33, 0x0000); /* GRAM Vertical Address */

        /* Adjust the Gamma Curve (ILI9325)---------------------------------------*/
        lcdWriteReg(LCD_REG_48, 0x0007);
        lcdWriteReg(LCD_REG_49, 0x0302);
        lcdWriteReg(LCD_REG_50, 0x0105);
        lcdWriteReg(LCD_REG_53, 0x0206);
        lcdWriteReg(LCD_REG_54, 0x0808);
        lcdWriteReg(LCD_REG_55, 0x0206);
        lcdWriteReg(LCD_REG_56, 0x0504);
        lcdWriteReg(LCD_REG_57, 0x0007);
        lcdWriteReg(LCD_REG_60, 0x0105);
        lcdWriteReg(LCD_REG_61, 0x0808);

        /* Set GRAM area ---------------------------------------------------------*/
        lcdWriteReg(LCD_REG_80, 0x0000); /* Horizontal GRAM Start Address */
        lcdWriteReg(LCD_REG_81, 0x00EF); /* Horizontal GRAM End Address */
        lcdWriteReg(LCD_REG_82, 0x0000); /* Vertical GRAM Start Address */
        lcdWriteReg(LCD_REG_83, 0x013F); /* Vertical GRAM End Address */

        lcdWriteReg(LCD_REG_96,  0xA700); /* Gate Scan Line(GS=1, scan direction is G320~G1) */
        lcdWriteReg(LCD_REG_97,  0x0001); /* NDL,VLE, REV */
        lcdWriteReg(LCD_REG_106, 0x0000); /* set scrolling line */

        /* Partial Display Control -----------------------------------------------*/
        lcdWriteReg(LCD_REG_128, 0x0000);
        lcdWriteReg(LCD_REG_129, 0x0000);
        lcdWriteReg(LCD_REG_130, 0x0000);
        lcdWriteReg(LCD_REG_131, 0x0000);
        lcdWriteReg(LCD_REG_132, 0x0000);
        lcdWriteReg(LCD_REG_133, 0x0000);

