zhelezyaka/stm32-tft/trunk/User/ili9325.c
        /* Panel Control ---------------------------------------------------------*/
        lcdWriteReg(LCD_REG_144, 0x0010);
        lcdWriteReg(LCD_REG_146, 0x0000);
        lcdWriteReg(LCD_REG_147, 0x0003);
        lcdWriteReg(LCD_REG_149, 0x0110);
        lcdWriteReg(LCD_REG_151, 0x0000);
        lcdWriteReg(LCD_REG_152, 0x0000);

        /* set GRAM write direction and BGR = 1 */
        /* I/D=00 (Horizontal : increment, Vertical : decrement) */
        /* AM=1 (address is updated in vertical writing direction) */
        lcdWriteReg(LCD_REG_3, 0x1018);

        lcdWriteReg(LCD_REG_7, 0x0133); /* 262K color and display ON */
        lcdSetFont(&LCD_DEFAULT_FONT);
    }
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void lcdSetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
    TextColor = _TextColor; 
    BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void lcdGetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
    *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void lcdSetTextColor(__IO uint16_t Color)
{
    TextColor = Color;
}

/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void lcdSetBackColor(__IO uint16_t Color)
{
    BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void lcdSetFont(sFONT *fonts)
{
    lcdCurrentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *lcdGetFont(void)
{
    return lcdCurrentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void lcdClearLine(uint8_t Line)
{
    uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;
    /* Send the string character by character on lCD */
    while (((refcolumn + 1)&0xFFFF) >= lcdCurrentfonts->Width)
    {
        /* Display one character on LCD */
        lcdDisplayChar(Line, refcolumn, ' ');
        /* Decrement the column position by 16 */
        refcolumn -= lcdCurrentfonts->Width;
    }
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void lcdClear(uint16_t Color)
{
    uint32_t index = 0;

    lcdSetCursor(0x00, 0x013F); 
    lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
    for(index = 0; index < 76800; index++)
    {
        ili9325_RAM = Color;
    }  
}

/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void lcdSetCursor(uint8_t Xpos, uint16_t Ypos)
{
    lcdWriteReg(LCD_REG_32, Xpos);
    lcdWriteReg(LCD_REG_33, Ypos);
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void lcdDrawChar(uint8_t Xpos, uint16_t Ypos, const uint16_t *c)
{
    uint32_t index = 0, i = 0;
    uint8_t Xaddress = 0;

    Xaddress = Xpos;

    lcdSetCursor(Xaddress, Ypos);
  
    for(index = 0; index < lcdCurrentfonts->Height; index++)
    {
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        for(i = 0; i < lcdCurrentfonts->Width; i++)
        {
            if((((c[index] & ((0x80 << ((lcdCurrentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(lcdCurrentfonts->Width <= 12))||
            (((c[index] & (0x1 << i)) == 0x00)&&(lcdCurrentfonts->Width > 12 )))

            {
                lcdWriteRAM(BackColor);
            }
            else
            {
                lcdWriteRAM(TextColor);
            }
        }
        Xaddress++;
        lcdSetCursor(Xaddress, Ypos);
    }
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void lcdDisplayChar(uint8_t Line, uint16_t Column, uint8_t Ascii)
{
    Ascii -= 32;
    lcdDrawChar(Line, Column, &lcdCurrentfonts->table[Ascii * lcdCurrentfonts->Height]);
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void lcdDisplayStringLine(uint8_t Line, uint8_t *ptr)
{
    uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;

  /* Send the string character by character on lCD */
    while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) >= lcdCurrentfonts->Width))
    {
        /* Display one character on LCD */
        lcdDisplayChar(Line, refcolumn, *ptr);
        /* Decrement the column position by 16 */
        refcolumn -= lcdCurrentfonts->Width;
        /* Point on the next character */
        ptr++;
    }
}

/**
  * @brief  Sets a display window
  * @param  Xpos: specifies the X buttom left position.
  * @param  Ypos: specifies the Y buttom left position.
  * @param  Height: display window height.
  * @param  Width: display window width.
  * @retval None
  */
void lcdSetDisplayWindow(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
    /* Horizontal GRAM Start Address */
    if(Xpos >= Height)
    {
        lcdWriteReg(LCD_REG_80, (Xpos - Height + 1));
    }
    else
    {
        lcdWriteReg(LCD_REG_80, 0);
    }
    /* Horizontal GRAM End Address */
    lcdWriteReg(LCD_REG_81, Xpos);
    /* Vertical GRAM Start Address */
    if(Ypos >= Width)
    {
        lcdWriteReg(LCD_REG_82, (Ypos - Width + 1));
    }  
    else
    {
        lcdWriteReg(LCD_REG_82, 0);
    }
    /* Vertical GRAM End Address */
    lcdWriteReg(LCD_REG_83, Ypos);
    lcdSetCursor(Xpos, Ypos);
}

/**
  * @brief  Disables LCD Window mode.
  * @param  None
  * @retval None
  */
void lcdWindowModeDisable(void)
{
    lcdSetDisplayWindow(239, 0x13F, 240, 320);
    lcdWriteReg(LCD_REG_3, 0x1018);    
}

/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void lcdDrawLine(uint8_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
    uint32_t i = 0;

