zhelezyaka/stm32-tft/trunk/User/ili9325.c
    lcdSetCursor(Xpos, Ypos);
    if(Direction == LCD_DIR_HORIZONTAL)
    {
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        for(i = 0; i < Length; i++)
        {
            lcdWriteRAM(TextColor);
        }
    }
    else
    {
        for(i = 0; i < Length; i++)
        {
            lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
            lcdWriteRAM(TextColor);
            Xpos++;
            lcdSetCursor(Xpos, Ypos);
        }
        }
    }

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void lcdDrawRect(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
    lcdDrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
    lcdDrawLine((Xpos + Height), Ypos, Width, LCD_DIR_HORIZONTAL);

    lcdDrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
    lcdDrawLine(Xpos, (Ypos - Width + 1), Height, LCD_DIR_VERTICAL);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void lcdDrawCircle(uint8_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int32_t  D;/* Decision Variable */ 
    uint32_t  CurX;/* Current X Value */
    uint32_t  CurY;/* Current Y Value */ 

    D = 3 - (Radius << 1);
    CurX = 0;
    CurY = Radius;

    while (CurX <= CurY)
    {
        lcdSetCursor(Xpos + CurX, Ypos + CurY);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos + CurX, Ypos - CurY);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos - CurX, Ypos + CurY);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos - CurX, Ypos - CurY);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos + CurY, Ypos + CurX);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos + CurY, Ypos - CurX);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos - CurY, Ypos + CurX);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        lcdSetCursor(Xpos - CurY, Ypos - CurX);
        lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
        lcdWriteRAM(TextColor);
        if (D < 0)
        { 
            D += (CurX << 2) + 6;
        }
        else
        {
            D += ((CurX - CurY) << 2) + 10;
            CurY--;
        }
        CurX++;
    }
}

/**
  * @brief  Displays a monocolor picture.
  * @param  Pict: pointer to the picture array.
  * @retval None
  */
void lcdDrawMonoPict(const uint32_t *Pict)
{
    uint32_t index = 0, i = 0;
    lcdSetCursor(0, (LCD_PIXEL_WIDTH - 1));
    lcdWriteRAM_Prepare(); /* Prepare to write GRAM */
    for(index = 0; index < 2400; index++)
    {
        for(i = 0; i < 32; i++)
        {
            if((Pict[index] & (1 << i)) == 0x00)
            {
                lcdWriteRAM(BackColor);
            }
            else
            {
                lcdWriteRAM(TextColor);
            }
        }
  }
}

/**
  * @brief  Displays a bitmap picture loaded in the internal Flash.
  * @param  BmpAddress: Bmp picture address in the internal Flash.
  * @retval None
  */
void lcdWriteBMP(uint32_t BmpAddress)
{
    uint32_t index = 0, size = 0;
    /* Read bitmap size */
    size = *(__IO uint16_t *) (BmpAddress + 2);
    size |= (*(__IO uint16_t *) (BmpAddress + 4)) << 16;
    /* Get bitmap data address offset */
    index = *(__IO uint16_t *) (BmpAddress + 10);
    index |= (*(__IO uint16_t *) (BmpAddress + 12)) << 16;
    size = (size - index)/2;
    BmpAddress += index;
    /* Set GRAM write direction and BGR = 1 */
    /* I/D=00 (Horizontal : decrement, Vertical : decrement) */
    /* AM=1 (address is updated in vertical writing direction) */
    lcdWriteReg(LCD_REG_3, 0x1008);

    lcdWriteRAM_Prepare();
 
    for(index = 0; index < size; index++)
    {
        lcdWriteRAM(*(__IO uint16_t *)BmpAddress);
        BmpAddress += 2;
    }
 
    /* Set GRAM write direction and BGR = 1 */
    /* I/D = 01 (Horizontal : increment, Vertical : decrement) */
    /* AM = 1 (address is updated in vertical writing direction) */
    lcdWriteReg(LCD_REG_3, 0x1018);
}

/**
  * @brief  Displays a full rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: rectangle height.
  * @param  Width: rectangle width.
  * @retval None
  */
void lcdDrawFullRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height)
{
    lcdSetTextColor(TextColor);

    lcdDrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
    lcdDrawLine((Xpos + Height), Ypos, Width, LCD_DIR_HORIZONTAL);

    lcdDrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
    lcdDrawLine(Xpos, (Ypos - Width + 1), Height, LCD_DIR_VERTICAL);

    Width -= 2;
    Height--;
    Ypos--;

    lcdSetTextColor(BackColor);

    while(Height--)
    {
        lcdDrawLine(++Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);    
    }

    lcdSetTextColor(TextColor);
}

/**
  * @brief  Displays a full circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void lcdDrawFullCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
    int32_t  D;    /* Decision Variable */ 
    uint32_t  CurX;/* Current X Value */
    uint32_t  CurY;/* Current Y Value */ 

    D = 3 - (Radius << 1);

    CurX = 0;
    CurY = Radius;

    lcdSetTextColor(BackColor);

    while (CurX <= CurY)
    {
        if(CurY > 0) 
        {
            lcdDrawLine(Xpos - CurX, Ypos + CurY, 2*CurY, LCD_DIR_HORIZONTAL);
            lcdDrawLine(Xpos + CurX, Ypos + CurY, 2*CurY, LCD_DIR_HORIZONTAL);
        }

        if(CurX > 0) 
        {
            lcdDrawLine(Xpos - CurY, Ypos + CurX, 2*CurX, LCD_DIR_HORIZONTAL);
            lcdDrawLine(Xpos + CurY, Ypos + CurX, 2*CurX, LCD_DIR_HORIZONTAL);
        }
        if (D < 0)
        { 
            D += (CurX << 2) + 6;
        }
        else
        {
            D += ((CurX - CurY) << 2) + 10;
            CurY--;
        }
        CurX++;
    }

    lcdSetTextColor(TextColor);
    lcdDrawCircle(Xpos, Ypos, Radius);
}

/**
  * @brief  Displays an uni line (between two points).
  * @param  x1: specifies the point 1 x position.
  * @param  y1: specifies the point 1 y position.
  * @param  x2: specifies the point 2 x position.
  * @param  y2: specifies the point 2 y position.
  * @retval None
  */
void lcdDrawUniLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
    int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0, 
    yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0, 
    curpixel = 0;

